Autodesk.Revit.ApplicationServices.Application.ExternalDataTypeUpdatedDataSourceIntoDocument
Subscribe to the ExternalDataTypeUpdatingDataSourceIntoDocument event to be notified when an ExternalDataType has updated its external data source into Revit Document.
Since:
2026

Autodesk.Revit.ApplicationServices.Application.ExternalDataTypeUpdatingDataSourceIntoDocument
Subscribe to the ExternalDataTypeUpdatingDataSourceIntoDocument event to be notified when an ExternalDataType is updating its external data source into Revit Document.
Since:
2026

Autodesk.Revit.ApplicationServices.Application.DocumentReadyToSaveToCentral
Subscribe to the DocumentReadyToSaveToCentral event to be notified when a document is ready to save to central.
Remarks:
This event is raised when Revit determines that a document is ready to be saved to the central model.
This event allows monitoring and control of the save to central workflow.
The event is raised before the actual save to central operation begins.
Event is canceled when Save to Central operation is canceled.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.LoadLinkException
Subscribe to the LoadLinkException event to be notified when a Revit link document fails to open due to a load exception.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.IsPrimaryProcess
Indicates whether or not this is the main Revit process.
Returns:
Returns true if this is the main Revit process, false if this is some worker process.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.HasCloudModelEntitlement
Indicates if the current logged-in user has Cloud Models for Revit entitlement.
Returns:
Returns true if the current logged-in user has Cloud Models for Revit entitlement; otherwise, returns false.
Since:
2019.2

Autodesk.Revit.ApplicationServices.Application.HasWorksharedCloudModelEntitlement
Indicates if the current logged-in user has Revit Cloud Worksharing entitlement.
Returns:
Returns true if the current logged-in user has Revit Cloud Worksharing entitlement; otherwise, return false.
Since:
2019.2

Autodesk.Revit.ApplicationServices.Application.GetCloudGUIDsByCloudModelInfo(System.String,System.String,System.String,System.String)
Gets RCM project GUID and model GUID from project id, folder id and model name.
region:
The region of cloud model.
projectId:
Project identity of cloud model.
folderId:
Folder identity of cloud model.
modelName:
Model name of cloud model.
Returns:
Returns a map including RCM project GUID and model GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.ApplicationServices.Application.HasCloudModelAccounts
Indicates if the current logged-in user has any Cloud Model accounts.
Returns:
Returns true if the current logged-in user has any Cloud Model accounts; otherwise, returns false.

Autodesk.Revit.ApplicationServices.Application.SharedComponentsLocation
Location of shared components used by Revit.
Since:
2026

Autodesk.Revit.ApplicationServices.Application.AllUsersAddinsLocation
The folder location for .addin files for all users.
Remarks:
The path may not exist on the file system, but the property will still return the expected path.
Since:
2014

Autodesk.Revit.ApplicationServices.Application.IsPrecastEnabled
Checks whether or not the precast is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
-or-
When setting this property: Concrete should be enabled to change Precast.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.IsConcreteEnabled
Checks whether or not the concrete discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.AddPublicExtendedApiService()
Adds a public extended API service.
Type of the service.
Type of the service implementation.
implementationInstance:
Instance of the service implementation.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.AddPublicExtendedApiService
Adds a public extended API service.
Type of the service.
Type of the service implementation.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.AddInternalExtendedApiService()
Adds an internal/non-public extended API service.
Type of the service.
Type of the service implementation.
implementationInstance:
Instance of the service implementation.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.AddInternalExtendedApiService
Adds an internal/non-public extended API service.
Type of the service.
Type of the service implementation.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.CreateInstanceWithInternalExtendedApiServices(System.Object[])
Creates an instance of the specified type that depends on Extended API services.
additionalParameters: Parameters that are not provided by Extended API services.
Returns:
Instance of the specified type.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.GetInternalExtendedApiService
Gets an internal-only extended API service of the specified type.
Type of the extended API service.
Returns:
Instance of the extended API service if available; otherwise, null.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.GetExtendedApiService
Gets an extended API service of the specified type.
Type of the extended API service.
Returns:
Instance of the extended API service if available; otherwise, null.
Since:
2027

Autodesk.Revit.ApplicationServices.Application.ActiveAddInId
Retrieves the Id of the currently running external application.
Remarks:
The application can be either a UI application, DB application, or an external command.
If no add-in is currently active, this property returns the AddInId containing the GUID of the native Revit application - RevitApplicationId.
If an event handler is currently being executed, the returned value will be the Id of the application or command in which the event handler was registered.